# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
data=[4, 8, 15, 16, 23, 42]
s=pd.Series(data)
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
data=[1,2,3,4,5,6,7,8,9,10]
s=pd.Series(data)
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:Then, print the DataFrame.

In [15]:
data={"Name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male","Female"]}

In [17]:
print(pd.DataFrame(data))

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.

In [19]:
data = {
    'Name': ['John', 'Jane', 'Bob', 'Alice'],
    'Age': [32, 24, 45, 27],
    
}

df = pd.DataFrame(data)

print(df)

    Name  Age
0   John   32
1   Jane   24
2    Bob   45
3  Alice   27

In [20]:
data = [10, 20, 30, 40, 50]

s = pd.Series(data)

print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Some common functions for manipulating data in a Pandas DataFrame are:

head() and tail() for quick look at the beginning or end of a DataFrame

describe() for generating summary statistics for each numerical column

groupby() for grouping data based on one or more columns and performing some aggregate function on each group

sort_values() for sorting the DataFrame by one or more columns

In [22]:
df=pd.read_csv("extract.csv")

In [23]:
df.head(2)

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0

In [24]:
df.tail(2)

                                           Name     Sex   Age
2                        Heikkinen, Miss. Laina  female  26.0
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0

In [25]:
df.describe()

         Age
count   4.00
mean   30.25
std     7.50
min    22.00
25%    25.00
50%    30.50
75%    35.75
max    38.00

In [34]:
d1=df.groupby('Sex')
d1.get_group('female')

                                                Name     Sex   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0

In [35]:
df.sort_values('Age')

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A mutable object is one that can be modified after it is created. Series and DataFrame can be modified by adding or deleting rows and columns, changing the values of existing cells, or reordering the data.

On the other hand, a Panel is a 3D data structure and is considered less commonly used than Series and DataFrame. Panels are also immutable, which means once they are created, they cannot be modified.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
ages = pd.Series([25, 32, 18, 47])
cities = pd.Series(['New York', 'San Francisco', 'Chicago', 'Boston'])
df = pd.DataFrame({'Name': names, 'Age': ages, 'City': cities})
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   32  San Francisco
2  Charlie   18        Chicago
3    David   47         Boston